configuration/src/Catalogs/PerformerRoles/PerformerRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PerformerRoles</name>
  <predefined>
    <items>
      <name>EmployeeResponsibleForTasksManagement</name>
      <description>Task coordinator</description>
    </items>
  </predefined>
  <attributes>
    <name>UsedWithoutAddressingObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BriefPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UsedByAddressingObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObjectTypes</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObjectTypes</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalRole</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeNode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.User</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/TaskPerformers/TaskPerformers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TaskPerformers</name>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <dimensions>
    <name>PerformerRole</name>
    <type>
      <types>CatalogRef.PerformerRoles</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsInternal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/PerformerRoles/Forms/ListForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetConditionalAppearance();
	
	ConfigureRoleListRepresentation();
	
	If Common.SubsystemExists("StandardSubsystems.NationalLanguageSupport") Then
		ModuleNationalLanguageSupportServer = Common.CommonModule("NationalLanguageSupportServer");
		ModuleNationalLanguageSupportServer.OnCreateAtServer(ThisObject);
	EndIf;
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "Write_ConstantsSet" And Source = "UseExternalUsers" Then
		ConfigureRoleListRepresentation();
	EndIf;
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ConfigureRoleListRepresentation()
	
	QueryText = "SELECT DISTINCT
	|	TaskPerformers.PerformerRole AS PerformerRole
	|INTO Assignees
	|FROM
	|	InformationRegister.TaskPerformers AS TaskPerformers
	|		LEFT JOIN Catalog.PerformerRoles AS CatalogPerformerRoles
	|		ON TaskPerformers.PerformerRole = CatalogPerformerRoles.Ref
	|;";
		
	If GetFunctionalOption("UseExternalUsers") Then
		
		QueryText = QueryText + "SELECT
		|	CatalogPerformerRoles.Ref,
		|	CatalogPerformerRoles.DeletionMark,
		|	CatalogPerformerRoles.Predefined,
		|	CatalogPerformerRoles.Code,
		|	CatalogPerformerRoles.Description,
		|	CatalogPerformerRoles.UsedWithoutAddressingObjects,
		|	CatalogPerformerRoles.UsedByAddressingObjects,
		|	CatalogPerformerRoles.MainAddressingObjectTypes,
		|	CatalogPerformerRoles.AdditionalAddressingObjectTypes,
		|	CatalogPerformerRoles.Comment,
		|	CASE
		|		WHEN CatalogPerformerRoles.UsedByAddressingObjects
		|			THEN TRUE
		|		WHEN CatalogPerformerRoles.Ref IN
		|				(SELECT
		|					Assignees.PerformerRole
		|				FROM
		|					Assignees AS Assignees
		|				WHERE
		|					Assignees.PerformerRole = CatalogPerformerRoles.Ref)
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS HasPerformers,
		|	CatalogPerformerRoles.ExternalRole,
		|	CatalogPerformerRoles.BriefPresentation
		|FROM
		|	Catalog.PerformerRoles AS CatalogPerformerRoles";
		
	Else
		
		QueryText = QueryText + "SELECT
		|	CatalogPerformerRoles.Ref,
		|	CatalogPerformerRoles.DeletionMark,
		|	CatalogPerformerRoles.Predefined,
		|	CatalogPerformerRoles.Code,
		|	CatalogPerformerRoles.Description,
		|	CatalogPerformerRoles.UsedWithoutAddressingObjects,
		|	CatalogPerformerRoles.UsedByAddressingObjects,
		|	CatalogPerformerRoles.MainAddressingObjectTypes,
		|	CatalogPerformerRoles.AdditionalAddressingObjectTypes,
		|	CatalogPerformerRoles.Comment,
		|	CASE
		|		WHEN CatalogPerformerRoles.UsedByAddressingObjects
		|			THEN TRUE
		|		WHEN CatalogPerformerRoles.Ref IN
		|				(SELECT
		|					Assignees.PerformerRole
		|				FROM
		|					Assignees AS Assignees
		|				WHERE
		|					Assignees.PerformerRole = CatalogPerformerRoles.Ref)
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS HasPerformers,
		|	CatalogPerformerRoles.ExternalRole,
		|	CatalogPerformerRoles.BriefPresentation
		|FROM
		|	Catalog.PerformerRoles.Purpose AS ExecutorRolesAssignment
		|		LEFT JOIN Catalog.PerformerRoles AS CatalogPerformerRoles
		|		ON ExecutorRolesAssignment.Ref = CatalogPerformerRoles.Ref
		|WHERE
		|	ExecutorRolesAssignment.UsersType = VALUE(Catalog.Users.EmptyRef)";
	EndIf;
	
	ListProperties = Common.DynamicListPropertiesStructure();
	ListProperties.MainTable              = "Catalog.PerformerRoles";
	ListProperties.DynamicDataRead = True;
	ListProperties.QueryText                 = QueryText;
	Common.SetDynamicListProperties(Items.List, ListProperties);
	
EndProcedure

&AtServer
Procedure SetConditionalAppearance()
	
	List.ConditionalAppearance.Items.Clear();
	Item = List.ConditionalAppearance.Items.Add();
	
	FilterItemsGroup = Item.Filter.Items.Add(Type("DataCompositionFilterItemGroup"));
	FilterItemsGroup .GroupType = DataCompositionFilterItemsGroupType.AndGroup;
	
	ItemFilter = FilterItemsGroup.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("HasPerformers");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	ItemFilter = FilterItemsGroup.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("ExternalRole");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	Item.Appearance.SetParameterValue("TextColor", StyleColors.RoleWithoutPerformers);
	
EndProcedure

#EndRegion
